Revit.Elements.StructuralFraming
A Revit FamilyInstance

Revit.Elements.StructuralFraming.#ctor(Autodesk.Revit.DB.FamilyInstance)
Wrap an existing FamilyInstance.
instance:

Revit.Elements.StructuralFraming.#ctor(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType,Autodesk.Revit.DB.FamilySymbol)
Internal constructor - creates a single StructuralFraming instance

Revit.Elements.StructuralFraming.#ctor(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType,Autodesk.Revit.DB.FamilySymbol)
Internal constructor - creates a single StructuralFraming instance

Revit.Elements.StructuralFraming.InitStructuralFraming(Autodesk.Revit.DB.FamilyInstance)
Initialize a StructuralFraming element
instance:

Revit.Elements.StructuralFraming.InitStructuralFraming(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType,Autodesk.Revit.DB.FamilySymbol)
Initialize a StructuralFraming element

Revit.Elements.StructuralFraming.InitStructuralFraming(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType,Autodesk.Revit.DB.FamilySymbol)
Initialize a StructuralFraming element

Revit.Elements.StructuralFraming.ByCurveLevelUpVectorAndType(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Autodesk.DesignScript.Geometry.Vector,Revit.Elements.StructuralType,Revit.Elements.FamilySymbol)
Create a Revit Structural Member - a special FamilyInstance
curve: The curve path for the structural member
upVector: The up vector for the element - this is required to determine the orientation of the element
level: The level on which the member should appear
structuralType: The type of the structural element - a beam, column, etc
structuralFramingType: The structural framing type representing the structural type
Returns:

Revit.Elements.StructuralFraming.BeamByCurve(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.FamilySymbol)
Create a beam.
curve: The curve which defines the center line of the beam.
level: The level with which you'd like the beam to be associated.
structuralFramingType: The structural framing type representing the beam.
Returns:

Revit.Elements.StructuralFraming.BraceByCurve(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.FamilySymbol)
Create a brace.
curve: The cruve which defines the center line of the brace.
level: The level with which you'd like the brace to be associated.
structuralFramingType: The structural framing type representing the brace.
Returns:

Revit.Elements.StructuralFraming.ColumnByCurve(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.FamilySymbol)
Create a column.
curve: The curve which defines the center line of the column.
level: The level with which you'd like the column to be associated.
structuralColumnType: The structural column type representing the column.
Returns:

Revit.Elements.StructuralFraming.FromExisting(Autodesk.Revit.DB.FamilyInstance,System.Boolean)
Construct a FamilyInstance from the Revit document.
familyInstance:
isRevitOwned:
Returns:

Revit.Elements.StructuralFraming.Location
Gets curve geometry from location of the specified structural element

Revit.Elements.StructuralFraming.Symbol
Gets family symbol from the specified structural element